ʟᴇᴛ ʜᴀɴᴅʟᴇʀ = ᴀsʏɴᴄ (ᴍ, { ᴄᴏɴɴ }) => {
 ʟᴇᴛ ᴛxᴛ = `╔═══════════════╗
┇➤ 𝙃𝙊𝙇𝘼, 𝙃𝙐𝙈𝘼𝙉𝙊
┇ *\`${ᴄᴏɴɴ.ɢᴇᴛɴᴀᴍᴇ(ᴍ.sᴇɴᴅᴇʀ)}\`* 
╚═══════════════╝

» 𝘉𝘪𝘦𝘯𝘷𝘦𝘯𝘪𝘥𝘰, 𝘦𝘴𝘵𝘦 𝘦𝘴 𝘶𝘯 𝘮𝘦𝘯𝘶́ 𝘳𝘦𝘴𝘶𝘮𝘪𝘥𝘰 𝘥𝘦 𝘵𝘰𝘥𝘰 𝘭𝘰 𝘲𝘶𝘦 𝘤𝘰𝘯𝘵𝘪𝘦𝘯𝘦 𝘌𝘭𝘥𝘦𝘳-𝘣𝘰𝘵.

*\`ɪɴꜰᴏ\`*

☆ 👨🏻‍💻 *ᴘᴇʀꜰɪʟ*
☆ 👨🏻‍💻 *ᴍᴇɴᴜ*
☆ 👨🏻‍💻 *ᴏᴡɴᴇʀ*
☆ 👨🏻‍💻 *ᴛᴏᴛᴀʟғᴜɴᴄɪᴏɴᴇs*
☆ 👨🏻‍💻 *ʀᴜɴᴛɪᴍᴇ*
☆ 👨🏻‍💻 *ʙᴏᴛʀᴇɢʟᴀs*
☆ 👨🏻‍💻 *ᴀғᴋ <ᴛᴇx>*
☆ 👨🏻‍💻 *sᴛᴀғғ*
☆ 👨🏻‍💻 *ʙʟᴏᴄᴋʟɪsᴛ*

*\`ᴀɪ\`*

☆ 🎯 *ʀᴇᴍɪɴɪ*
☆ 🎯 *ʜᴅ*
☆ 🎯 *ᴇɴʜᴀɴᴄᴇ*
☆ 🎯 *ᴡᴀʟʟᴘᴀᴘᴇʀ <ᴛxᴛ>*
☆ 🎯 *ɢᴇᴍɪɴɪ / ɪᴀ*
☆ 🎯 *ᴘɪxᴀɪ*

 *\`ʙᴜꜱᴏ̨ᴜᴇᴅᴀꜱ\`*

☆ 🕵🏻‍♂️ *ɢᴏᴏɢʟᴇ <ʙᴜ́ꜱǫᴜᴇᴅᴀ>*
☆ 🕵🏻‍♂️ *ᴛɪᴋᴛᴏᴋꜱᴇᴀʀᴄʜ <ᴛxᴛ>*
☆ 🕵🏻‍♂️ *ʏᴛꜱᴇᴀʀᴄʜ*
☆ 🕵🏻‍♂️ *ɪᴍᴀɢᴇɴ <ᴛxᴛ>*
☆ 🕵🏻‍♂️ *ᴘʟᴀʏ* <ᴍᴜꜱɪᴄᴀ>
☆ 🕵🏻‍♂️ *ʏᴛᴅʟᴍᴘ4* <ɴᴏᴍʙʀᴇ>
☆ 🕵🏻‍♂️ *ʏᴛᴅʟᴍᴘ3* <ɴᴏᴍʙʀᴇ>

‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌‍‌‍‌‍‌‍‌‍‌‌‍‍‍‍‌
 *\`ᴊᴜᴇɢᴏꜱ\`*

☆ 🕹️ *ɢᴀʏ <@ᴛᴀɢ>*
☆ 🕹️ *ᴍᴀɴᴄᴏ <@ᴛᴀɢ>*
☆ 🕹️ *ᴍᴀɴᴄᴀ <@ᴛᴀɢ>*
☆ 🕹️ *ᴘᴜᴛᴏ <@ᴛᴀɢ>*
☆ 🕹️ *ᴘᴜᴛᴀ <@ᴛᴀɢ>*
☆ 🕹️ *ᴘᴀᴊᴇʀᴏ <@ᴛᴀɢ>*
☆ 🕹️ *ᴘᴀᴊᴇʀᴀ <@ᴛᴀɢ>*
☆ 🕹️ *ʀᴀᴛᴀ <@ᴛᴀɢ>*
☆ 🕹️ *ᴅᴀᴅᴏ <@ᴛᴀɢ>*
☆ 🕹️ *ᴅᴇᴄʟᴀʀᴀᴄɪᴏ́ɴ*
☆ 🕹️ *ғᴏʀᴍᴀʀᴘᴀʀᴇᴊᴀ*
☆ 🕹️ *ʀᴇᴛᴏ*
☆ 🕹️ *sᴏᴘᴀ*
☆ 🕹️ *ʟᴏᴠᴇ*
☆ 🕹️ *ʟᴏᴠᴇ2 <@ᴛᴀɢ>*
☆ 🕹️ *ᴍᴇᴍᴇ*
☆ 🕹️ *ʀᴜʟᴇᴛᴀ*
☆ 🕹️ *ᴀʙʀᴀᴢᴀʀ <@ᴛᴀɢ>*
☆ 🕹️ *ᴀᴄᴇʀᴛɪᴊᴏ*
☆ 🕹️ *ꜱᴏɴʀᴏᴊᴀʀꜱᴇ <@ᴛᴀɢ>*
☆ 🕹️ *ᴄᴏɴꜱᴇᴊᴏ*
☆ 🕹️ *ᴇɴᴀᴍᴏʀᴀᴅᴀ <@ᴛᴀɢ>*
☆ 🕹️ *ᴍᴇᴍᴇ*
☆ 🕹️ *ᴀᴄᴀʀɪᴄɪᴀʀ <@ᴛᴀɢ>*
☆ 🕹️ *ᴘᴇʀꜱᴏɴᴀʟɪᴅᴀᴅ*
☆ 🕹️ *ᴘɪʀᴏᴘᴏ*
☆ 🕹️ *ᴘᴏᴋᴇᴅᴇx <ᴘᴏᴋᴇᴍᴏ́ɴ>*
☆ 🕹️ *ᴘʀᴇɢᴜɴᴛᴀ*
☆ 🕹️ *ᴅᴏʀᴍɪʀ <@ᴛᴀɢ>*
☆ 🕹️ *ᴛʀɪꜱᴛᴇ <@ᴛᴀɢ>*
☆ 🕹️ *ᴛᴏᴘ <ᴛxᴛ>*
☆ 🕹️ *ᴢᴏᴅɪᴀᴄ <2010 03 15*

 *\`ʀᴘɢ\`*

☆ 📌 *ʙᴀʟ*
☆ 📌 *ᴄʀɪᴍᴇɴ*
☆ 📌 *ᴅᴀɪʟʏ*
☆ 📌 *ᴄʟᴀɪᴍ*
☆ 📌 *ᴅᴇᴘᴏꜱɪᴛᴀʀ*
☆ 📌 *ʟʙ*
☆📌 *ʀᴇᴛɪʀᴀʀ*
☆ 📌 *ʀᴏʙ2*
☆ 📌 *ʀᴏʙ*
☆ 📌 *ᴛʀᴀʙᴀᴊᴀʀ*
☆ 📌 *ʙᴜʏ*
☆ 📌 *ʙᴜʏ ᴀʟʟ*

 *\`ꜱᴛɪᴄᴋᴇʀꜱ\`*

☆ 🎭 *ǫᴄ*
☆ 🎭 *ꜱᴛɪᴋᴇʀ <ɪᴍɢ>*
☆ 🎭 *ꜱᴛɪᴄᴋᴇʀ <ᴜʀʟ>*
☆ 🎭 *ᴛᴀᴋᴇ <ɴᴏᴍʙʀᴇ/ᴀᴜᴛᴏʀ>*

 *\`+18\`*

☆ 🔞 *xɴxxꜱᴇᴀʀᴄʜ <ᴛxᴛ>*
☆ 🔞 *xɴxxᴅʟ <ʟɪɴᴋ>*

 *\`ɢʀᴜᴘᴏꜱ\`*

☆ 👑 *ʟɪɴᴋ*
☆ 👑 *ɢʀᴜᴘᴏ ᴏᴘᴇɴ / ᴄʟᴏꜱᴇ*
☆ 👑 *ᴅᴇʟᴇᴛᴇ*
☆ 👑 *ᴅᴇᴍᴏᴛᴇ*
☆ 👑 *ᴘʀᴏᴍᴏᴛᴇ*
☆ 👑 *ᴇɴᴄᴜᴇꜱᴛᴀ <ᴛxᴛ / ᴛxᴛ>*
☆ 👑 *ʜɪᴅᴇᴛᴀɢ*
☆ 👑 *ɪɴꜰᴏɢʀᴜᴘᴏ*
☆ 👑 *ᴋɪᴄᴋ*
☆ 👑 *ʟɪꜱᴛᴀᴅᴠ*
☆ 👑 *ᴛᴀɢᴀʟʟ <ᴛxᴛ>*
☆ 👑 *ɪɴᴠᴏᴄᴀʀ <ᴛxᴛ>*
☆ 👑 *ʙᴀɴᴄʜᴀᴛ*
☆ 👑 *ᴜɴʙᴀɴᴄʜᴀᴛ*
☆ 👑 *ʙᴀɴᴜsᴇʀ <@ᴛᴀɢ>*
☆ 👑 *ᴜɴʙᴀɴᴜsᴇʀ <@ᴛᴀɢ>*
☆ 👑 *ʀᴜʟᴇᴛᴀʙᴀɴ*
☆ 👑 *ɪɴᴀᴄᴛɪᴠᴏs*
☆ 👑 *ᴀᴅᴍɪɴs <ᴛxᴛ>*
☆ 👑 *sᴏʀᴛᴇᴏ*

 *\`ᴏɴ/ᴏꜰꜰ\`*

☆ ⚙️ *ᴇɴᴀʙʟᴇ*
☆ ⚙️ *ᴅɪꜱᴀʙʟᴇ*

 *\`ᴅᴇꜱᴄᴀʀɢᴀꜱ\`*

☆ 📂 *ꜰᴀᴄᴇʙᴏᴏᴋ - ꜰʙ*
☆ 📂 *ɪᴍᴀɢᴇɴ <ᴛxᴛ>*
☆ 📂 *ɪɴꜱᴛᴀɢʀᴀᴍ - ɪɢ*
☆ 📂 *ᴛɪᴋᴛᴏᴋ*
☆ 📂 *ʏᴛᴍᴘ4*
☆ 📂 *ʏᴛᴍᴘ3*
☆ 📂 *ᴄʟɪᴍᴀ*
☆ 📂 *ᴅᴇᴍᴏ*
☆ 📂 *ғᴜx*
☆ 📂 *ғᴀᴋᴇ*
☆ 📂 *ɢᴇᴛ*
☆ 📂 *ᴅɪғᴜᴍɪɴᴀʀ*

 *\`ʜᴇʀʀᴀᴍɪᴇɴᴛᴀꜱ\`*

☆ ⚙️ *ᴛᴏᴀɴɪᴍᴇ*
☆ ⚙️ *ʀᴇᴍɪɴɪ*
☆ ⚙️ *ʜᴅ*
☆ ⚙️ *ᴇɴʜᴀɴᴄᴇ*
☆ ⚙️ *ꜱꜱᴡᴇʙ*
☆ ⚙️ *ꜱꜱ*
☆ ⚙️ *ᴛʀᴀᴅ*

 *\`ᴄᴏɴᴠᴇʀᴛɪᴅᴏʀᴇꜱ\`*

☆ 🎋 *ᴛᴏɢɪꜰᴀᴜᴅ*
☆ 🎋 *ᴛᴏɪᴍɢ*
☆ 🎋 *ᴛᴏᴀᴜᴅɪᴏ*

*\`ʟᴏɢᴏs\'*

☆ ⚡ *ʟᴏɢᴏᴄᴏʀᴀᴢᴏɴ*
☆ ⚡ *ʟᴏɢᴏɴᴀʀᴜᴛᴏ*
☆ ⚡ *ʟᴏɢᴏᴘᴀʀᴇᴊᴀ*
☆ ⚡ *ʟᴏɢᴏɢᴀᴛɪᴛᴏ*
☆ ⚡ *ʟᴏɢᴏɴᴇᴏɴ*
☆ ⚡ *ʟᴏɢᴏsᴏʟɪᴛᴀʀɪᴏ*
☆ ⚡ *ʟᴏɢᴏғᴜʀɪsᴛᴀ*
☆ ⚡ *ʟᴏɢᴏɴᴜʙᴇ*
☆ ⚡ *ʟᴏɢᴏᴀɴɢᴇʟ*
☆ ⚡ *ʟᴏɢᴏᴍᴜʀᴄɪᴇʟᴀɢᴏ*
☆ ⚡ *ʟᴏɢᴏʜᴏʀʀᴏʀ*
☆ ⚡ *ʟᴏɢᴏᴄɪᴇʟᴏ*
☆ ⚡ *ʟᴏɢᴏᴘᴏʀᴛᴀᴅᴀғғ*
☆ ⚡ *ʟᴏɢᴏᴘᴜɢ*
☆ ⚡ *ʟᴏɢᴏɢᴜᴇʀʀᴇʀᴏ*
 
> *© ⍴᥆ᥕᥱʀᥱძ ᑲᥡ һᥒ ᥱᥣძᥱʀ*`.ᴛʀɪᴍ();

ᴍ.ʀᴇᴀᴄᴛ('✅');
ʟᴇᴛ ᴘᴇʀғɪʟ = ᴀᴡᴀɪᴛ ᴄᴏɴɴ.ᴘʀᴏғɪʟᴇᴘɪᴄᴛᴜʀᴇᴜʀʟ(ᴍ.sᴇɴᴅᴇʀ, 'ɪᴍᴀɢᴇ').ᴄᴀᴛᴄʜ(_ => 'ʜᴛᴛᴘs://ɪ.ɪʙʙ.ᴄᴏ/5xᴍs19ɴx/ғɪʟᴇ.ᴊᴘɢ');

/* ᴀᴡᴀɪᴛ ᴄᴏɴɴ.sᴇɴᴅᴍᴇssᴀɢᴇ(ᴍ.ᴄʜᴀᴛ, { ᴛᴇxᴛ: ᴛxᴛ, ᴄᴏɴᴛᴇxᴛɪɴғᴏ: { ᴇxᴛᴇʀɴᴀʟᴀᴅʀᴇᴘʟʏ: { ᴛɪᴛʟᴇ: ʙᴏᴛɴᴀᴍᴇ, ʙᴏᴅʏ: ᴅᴇᴠ, ᴛʜᴜᴍʙɴᴀɪʟᴜʀʟ: ʙᴀɴɴᴇʀ, ᴍᴇᴅɪᴀᴛʏᴘᴇ: 1, sʜᴏᴡᴀᴅᴀᴛᴛʀɪʙᴜᴛɪᴏɴ: ᴛʀᴜᴇ, ʀᴇɴᴅᴇʀʟᴀʀɢᴇʀᴛʜᴜᴍʙɴᴀɪʟ: ᴛʀᴜᴇ }}} , { ǫᴜᴏᴛᴇᴅ: ᴍ })
};
*/
ʟᴇᴛ ʙᴀɴɴ = 'ʜᴛᴛᴘs://ᴄᴅɴᴍᴇɢᴀ.ᴠᴇʀᴄᴇʟ.ᴀᴘᴘ/ᴍᴇᴅɪᴀ/9ᴡʙ1ʜʟʀᴛ@ᴊᴄɴ5ʏʀᴢ18ɴᴊᴏᴋᴏᴘᴍʏᴋ-ss9ᴜ-ᴏᴢᴄ4sʏᴋ_2ʀsᴠxxǫ6ᴡxɪ';

ᴄᴏɴɴ.sᴇɴᴅᴍᴇssᴀɢᴇ(ᴍ.ᴄʜᴀᴛ, { ɪᴍᴀɢᴇ: { ᴜʀʟ: ʙᴀɴɴ }, ᴄᴀᴘᴛɪᴏɴ: ᴛxᴛ }, { ǫᴜᴏᴛᴇᴅ: ᴍ });
}

ʜᴀɴᴅʟᴇʀ.ᴄᴏᴍᴍᴀɴᴅ = ['ᴀʟʟᴍᴇɴᴜ', 'ᴍᴇɴᴜ', 'ᴍᴇɴᴜᴀʟʟ', 'ᴍᴇɴᴜᴄᴏᴍᴘʟᴇᴛᴏ'];

ᴇxᴘᴏʀᴛ ᴅᴇғᴀᴜʟᴛ ʜᴀɴᴅʟᴇʀ;

/* ɪᴍᴘᴏʀᴛ { ᴘʀᴏᴍɪsᴇs } ғʀᴏᴍ 'ғs'
ɪᴍᴘᴏʀᴛ { ᴊᴏɪɴ } ғʀᴏᴍ 'ᴘᴀᴛʜ'
ɪᴍᴘᴏʀᴛ ғᴇᴛᴄʜ ғʀᴏᴍ 'ɴᴏᴅᴇ-ғᴇᴛᴄʜ'
ɪᴍᴘᴏʀᴛ { xᴘʀᴀɴɢᴇ } ғʀᴏᴍ '../ʟɪʙ/ʟᴇᴠᴇʟʟɪɴɢ.ᴊs'

ʟᴇᴛ ᴛᴀɢs = {
  'ᴄʀᴏᴡ': '✨「 *`ᴍᴇɴᴜs ᴇʟᴅᴇʀ-ʙᴏᴛ`* 」👑',
  'ᴍᴀɪɴ': '「ɪɴғᴏ」🍨',
  'ʙᴜsᴄᴀᴅᴏʀ': '「ʙᴜsǫᴜᴇᴅᴀs」🍨',
  'ғᴜɴ': '「ᴊᴜᴇɢᴏs」🍨',
  'sᴇʀʙᴏᴛ': '「sᴜʙ ʙᴏᴛs」🍨',
  'ʀᴘɢ': '「ʀᴘɢ」🍨',
  'ʀɢ': '「ʀᴇɢɪsᴛʀᴏ」🍨',
  'sᴛɪᴄᴋᴇʀ': '「sᴛɪᴄᴋᴇʀs」🍨',
  'ᴇᴍᴏx': '「ᴀɴɪᴍᴇs」🍨',
  'ᴅᴀᴛᴀʙᴀsᴇ': '「ᴅᴀᴛᴀʙᴀsᴇ」🍨',
  'ɢʀᴜᴘᴏ': '「ɢʀᴜᴘᴏs」🍨',
  'ɴᴀʙʟᴇ': '「ᴏɴ / ᴏғғ」', 
  'ᴅᴇsᴄᴀʀɢᴀs': '「ᴅᴇsᴄᴀʀɢᴀs」🍨',
  'ᴛᴏᴏʟs': '「ʜᴇʀʀᴀᴍɪᴇɴᴛᴀs」🍨',
  'ɪɴғᴏ': '「ɪɴғᴏʀᴍᴀᴄɪᴏ́ɴ」🍨',
  'ᴏᴡɴᴇʀ': '「ᴄʀᴇᴀᴅᴏʀ」🍨',
  'ʟᴏɢᴏs': '「ᴇᴅɪᴄɪᴏɴ ʟᴏɢᴏs」🍨', 
}

ᴄᴏɴsᴛ ɪᴍɢɢ = ['ʜᴛᴛᴘs://ғɪʟᴇs.ᴄᴀᴛʙᴏx.ᴍᴏᴇ/ɪ7ᴜᴏ2ʟ.ᴊᴘɢ', 'ʜᴛᴛᴘs://ғɪʟᴇs.ᴄᴀᴛʙᴏx.ᴍᴏᴇ/ɪ7ᴜᴏ2ʟ.ᴊᴘɢ', 'ʜᴛᴛᴘs://ғɪʟᴇs.ᴄᴀᴛʙᴏx.ᴍᴏᴇ/ɪ7ᴜᴏ2ʟ.ᴊᴘɢ']

//   ʙᴇғᴏʀᴇ: `*•:•:•:•:•:•:•:•:•:•☾☼☽•:•.•:•.•:•:•:•:•:•*
ᴄᴏɴsᴛ ᴅᴇғᴀᴜʟᴛᴍᴇɴᴜ = {
"*%ɢʀᴇᴇᴛɪɴɢ* ʜᴏʟᴀ %ɴᴀᴍᴇ"

» 𝘉𝘪𝘦𝘯𝘷𝘦𝘯𝘪𝘥𝘰, 𝘦𝘴𝘵𝘦 𝘦𝘴 𝘶𝘯 𝘮𝘦𝘯𝘶́ 𝘳𝘦𝘴𝘶𝘮𝘪𝘥𝘰 𝘥𝘦 𝘵𝘰𝘥𝘰 𝘭𝘰 𝘲𝘶𝘦 𝘤𝘰𝘯𝘵𝘪𝘦𝘯𝘦 𝘌𝘭𝘥𝘦𝘳-𝘣𝘰𝘵.
%ʀᴇᴀᴅᴍᴏʀᴇ

\ᴛ*(✰◠‿◠) 𝐂 𝐨 𝐦 𝐚 𝐧 𝐝 𝐨 𝐬*   
`.ᴛʀɪᴍsᴛᴀʀᴛ(),
  ʜᴇᴀᴅᴇʀ: '*┏━━━━━✦━━━━━┓*\ɴ %ᴄᴀᴛᴇɢᴏʀʏ \ɴ*┗━━━━━✦━━━━━┛*',
  ʙᴏᴅʏ: '┊➤ %ᴄᴍᴅ',
  ғᴏᴏᴛᴇʀ: '*┗━*\ɴ',
  ᴀғᴛᴇʀ: `> ${ᴅᴇᴠ}`,
}
ʟᴇᴛ ʜᴀɴᴅʟᴇʀ = ᴀsʏɴᴄ (ᴍ, { ᴄᴏɴɴ, ᴜsᴇᴅᴘʀᴇғɪx: _ᴘ, __ᴅɪʀɴᴀᴍᴇ }) => {
  ᴛʀʏ {
    ʟᴇᴛ _ᴘᴀᴄᴋᴀɢᴇ = ᴊsᴏɴ.ᴘᴀʀsᴇ(ᴀᴡᴀɪᴛ ᴘʀᴏᴍɪsᴇs.ʀᴇᴀᴅғɪʟᴇ(ᴊᴏɪɴ(__ᴅɪʀɴᴀᴍᴇ, '../ᴘᴀᴄᴋᴀɢᴇ.ᴊsᴏɴ')).ᴄᴀᴛᴄʜ(_ => ({}))) || {}
    ʟᴇᴛ { ᴇxᴘ, ᴇsᴛʀᴇʟʟᴀs, ʟᴇᴠᴇʟ, ʀᴏʟᴇ } = ɢʟᴏʙᴀʟ.ᴅʙ.ᴅᴀᴛᴀ.ᴜsᴇʀs[ᴍ.sᴇɴᴅᴇʀ]
    ʟᴇᴛ { ᴍɪɴ, xᴘ, ᴍᴀx } = xᴘʀᴀɴɢᴇ(ʟᴇᴠᴇʟ, ɢʟᴏʙᴀʟ.ᴍᴜʟᴛɪᴘʟɪᴇʀ)
    ʟᴇᴛ ɴᴀᴍᴇ = ᴀᴡᴀɪᴛ ᴄᴏɴɴ.ɢᴇᴛɴᴀᴍᴇ(ᴍ.sᴇɴᴅᴇʀ)
    ᴇxᴘ = ᴇxᴘ || 'ᴅᴇsᴄᴏɴᴏᴄɪᴅᴀ';
    ʀᴏʟᴇ = ʀᴏʟᴇ || 'ᴀʟᴅᴇᴀɴᴏ';
    ʟᴇᴛ ᴅ = ɴᴇᴡ ᴅᴀᴛᴇ(ɴᴇᴡ ᴅᴀᴛᴇ + 3600000)
    ʟᴇᴛ ʟᴏᴄᴀʟᴇ = 'ᴇs'
    ʟᴇᴛ ᴡᴇᴛᴏɴ = ['ᴘᴀʜɪɴɢ', 'ᴘᴏɴ', 'ᴡᴀɢᴇ', 'ᴋʟɪᴡᴏɴ', 'ʟᴇɢɪ'][ᴍᴀᴛʜ.ғʟᴏᴏʀ(ᴅ / 84600000) % 5]
    ʟᴇᴛ ᴡᴇᴇᴋ = ᴅ.ᴛᴏʟᴏᴄᴀʟᴇᴅᴀᴛᴇsᴛʀɪɴɢ(ʟᴏᴄᴀʟᴇ, { ᴡᴇᴇᴋᴅᴀʏ: 'ʟᴏɴɢ' })
    ʟᴇᴛ ᴅᴀᴛᴇ = ᴅ.ᴛᴏʟᴏᴄᴀʟᴇᴅᴀᴛᴇsᴛʀɪɴɢ(ʟᴏᴄᴀʟᴇ, {
      ᴅᴀʏ: 'ɴᴜᴍᴇʀɪᴄ',
      ᴍᴏɴᴛʜ: 'ʟᴏɴɢ',
      ʏᴇᴀʀ: 'ɴᴜᴍᴇʀɪᴄ'
    })
    ʟᴇᴛ ᴅᴀᴛᴇɪsʟᴀᴍɪᴄ = ɪɴᴛʟ.ᴅᴀᴛᴇᴛɪᴍᴇғᴏʀᴍᴀᴛ(ʟᴏᴄᴀʟᴇ + '-ᴛɴ-ᴜ-ᴄᴀ-ɪsʟᴀᴍɪᴄ', {
      ᴅᴀʏ: 'ɴᴜᴍᴇʀɪᴄ',
      ᴍᴏɴᴛʜ: 'ʟᴏɴɢ',
      ʏᴇᴀʀ: 'ɴᴜᴍᴇʀɪᴄ'
    }).ғᴏʀᴍᴀᴛ(ᴅ)
ʟᴇᴛ ʙᴏᴛɪɴғᴏ = (ᴄᴏɴɴ.ᴜsᴇʀ.ᴊɪᴅ == ɢʟᴏʙᴀʟ.ᴄᴏɴɴ.ᴜsᴇʀ.ᴊɪᴅ ? 'ᴏғɪᴄɪᴀʟ' : 'sᴜʙ-ʙᴏᴛ');

    ʟᴇᴛ ᴛɪᴍᴇ = ᴅ.ᴛᴏʟᴏᴄᴀʟᴇᴛɪᴍᴇsᴛʀɪɴɢ(ʟᴏᴄᴀʟᴇ, {
      ʜᴏᴜʀ: 'ɴᴜᴍᴇʀɪᴄ',
      ᴍɪɴᴜᴛᴇ: 'ɴᴜᴍᴇʀɪᴄ',
      sᴇᴄᴏɴᴅ: 'ɴᴜᴍᴇʀɪᴄ'
    })
    ʟᴇᴛ _ᴜᴘᴛɪᴍᴇ = ᴘʀᴏᴄᴇss.ᴜᴘᴛɪᴍᴇ() * 1000
    ʟᴇᴛ _ᴍᴜᴘᴛɪᴍᴇ
    ɪғ (ᴘʀᴏᴄᴇss.sᴇɴᴅ) {
      ᴘʀᴏᴄᴇss.sᴇɴᴅ('ᴜᴘᴛɪᴍᴇ')
      _ᴍᴜᴘᴛɪᴍᴇ = ᴀᴡᴀɪᴛ ɴᴇᴡ ᴘʀᴏᴍɪsᴇ(ʀᴇsᴏʟᴠᴇ => {
        ᴘʀᴏᴄᴇss.ᴏɴᴄᴇ('ᴍᴇssᴀɢᴇ', ʀᴇsᴏʟᴠᴇ)
        sᴇᴛᴛɪᴍᴇᴏᴜᴛ(ʀᴇsᴏʟᴠᴇ, 1000)
      }) * 1000
    }
    ʟᴇᴛ ᴍᴜᴘᴛɪᴍᴇ = ᴄʟᴏᴄᴋsᴛʀɪɴɢ(_ᴍᴜᴘᴛɪᴍᴇ)
    ʟᴇᴛ ᴜᴘᴛɪᴍᴇ = ᴄʟᴏᴄᴋsᴛʀɪɴɢ(_ᴜᴘᴛɪᴍᴇ)
    ʟᴇᴛ ᴛᴏᴛᴀʟʀᴇɢ = ᴏʙᴊᴇᴄᴛ.ᴋᴇʏs(ɢʟᴏʙᴀʟ.ᴅʙ.ᴅᴀᴛᴀ.ᴜsᴇʀs).ʟᴇɴɢᴛʜ
    ʟᴇᴛ ʀᴛᴏᴛᴀʟʀᴇɢ = ᴏʙᴊᴇᴄᴛ.ᴠᴀʟᴜᴇs(ɢʟᴏʙᴀʟ.ᴅʙ.ᴅᴀᴛᴀ.ᴜsᴇʀs).ғɪʟᴛᴇʀ(ᴜsᴇʀ => ᴜsᴇʀ.ʀᴇɢɪsᴛᴇʀᴇᴅ == ᴛʀᴜᴇ).ʟᴇɴɢᴛʜ
    ʟᴇᴛ ʜᴇʟᴘ = ᴏʙᴊᴇᴄᴛ.ᴠᴀʟᴜᴇs(ɢʟᴏʙᴀʟ.ᴘʟᴜɢɪɴs).ғɪʟᴛᴇʀ(ᴘʟᴜɢɪɴ => !ᴘʟᴜɢɪɴ.ᴅɪsᴀʙʟᴇᴅ).ᴍᴀᴘ(ᴘʟᴜɢɪɴ => {
      ʀᴇᴛᴜʀɴ {
        ʜᴇʟᴘ: ᴀʀʀᴀʏ.ɪsᴀʀʀᴀʏ(ᴘʟᴜɢɪɴ.ᴛᴀɢs) ? ᴘʟᴜɢɪɴ.ʜᴇʟᴘ : [ᴘʟᴜɢɪɴ.ʜᴇʟᴘ],
        ᴛᴀɢs: ᴀʀʀᴀʏ.ɪsᴀʀʀᴀʏ(ᴘʟᴜɢɪɴ.ᴛᴀɢs) ? ᴘʟᴜɢɪɴ.ᴛᴀɢs : [ᴘʟᴜɢɪɴ.ᴛᴀɢs],
        ᴘʀᴇғɪx: 'ᴄᴜsᴛᴏᴍᴘʀᴇғɪx' ɪɴ ᴘʟᴜɢɪɴ,
        ᴇsᴛʀᴇʟʟᴀs: ᴘʟᴜɢɪɴ.ᴇsᴛʀᴇʟʟᴀs,
        ᴘʀᴇᴍɪᴜᴍ: ᴘʟᴜɢɪɴ.ᴘʀᴇᴍɪᴜᴍ,
        ᴇɴᴀʙʟᴇᴅ: !ᴘʟᴜɢɪɴ.ᴅɪsᴀʙʟᴇᴅ,
      }
    })
    ғᴏʀ (ʟᴇᴛ ᴘʟᴜɢɪɴ ᴏғ ʜᴇʟᴘ)
      ɪғ (ᴘʟᴜɢɪɴ && 'ᴛᴀɢs' ɪɴ ᴘʟᴜɢɪɴ)
        ғᴏʀ (ʟᴇᴛ ᴛᴀɢ ᴏғ ᴘʟᴜɢɪɴ.ᴛᴀɢs)
          ɪғ (!(ᴛᴀɢ ɪɴ ᴛᴀɢs) && ᴛᴀɢ) ᴛᴀɢs[ᴛᴀɢ] = ᴛᴀɢ
    ᴄᴏɴɴ.ᴍᴇɴᴜ = ᴄᴏɴɴ.ᴍᴇɴᴜ ? ᴄᴏɴɴ.ᴍᴇɴᴜ : {}
    ʟᴇᴛ ʙᴇғᴏʀᴇ = ᴄᴏɴɴ.ᴍᴇɴᴜ.ʙᴇғᴏʀᴇ || ᴅᴇғᴀᴜʟᴛᴍᴇɴᴜ.ʙᴇғᴏʀᴇ
    ʟᴇᴛ ʜᴇᴀᴅᴇʀ = ᴄᴏɴɴ.ᴍᴇɴᴜ.ʜᴇᴀᴅᴇʀ || ᴅᴇғᴀᴜʟᴛᴍᴇɴᴜ.ʜᴇᴀᴅᴇʀ
    ʟᴇᴛ ʙᴏᴅʏ = ᴄᴏɴɴ.ᴍᴇɴᴜ.ʙᴏᴅʏ || ᴅᴇғᴀᴜʟᴛᴍᴇɴᴜ.ʙᴏᴅʏ
    ʟᴇᴛ ғᴏᴏᴛᴇʀ = ᴄᴏɴɴ.ᴍᴇɴᴜ.ғᴏᴏᴛᴇʀ || ᴅᴇғᴀᴜʟᴛᴍᴇɴᴜ.ғᴏᴏᴛᴇʀ
    ʟᴇᴛ ᴀғᴛᴇʀ = ᴄᴏɴɴ.ᴍᴇɴᴜ.ᴀғᴛᴇʀ || (ᴄᴏɴɴ.ᴜsᴇʀ.ᴊɪᴅ == ᴄᴏɴɴ.ᴜsᴇʀ.ᴊɪᴅ ? '' : `ᴘᴏᴡᴇʀᴇᴅ ʙʏ ʜᴛᴛᴘs://ᴡᴀ.ᴍᴇ/${ᴄᴏɴɴ.ᴜsᴇʀ.ᴊɪᴅ.sᴘʟɪᴛ`@`[0]}`) + ᴅᴇғᴀᴜʟᴛᴍᴇɴᴜ.ᴀғᴛᴇʀ
    ʟᴇᴛ _ᴛᴇxᴛ = [
      ʙᴇғᴏʀᴇ,
      ...ᴏʙᴊᴇᴄᴛ.ᴋᴇʏs(ᴛᴀɢs).ᴍᴀᴘ(ᴛᴀɢ => {
        ʀᴇᴛᴜʀɴ ʜᴇᴀᴅᴇʀ.ʀᴇᴘʟᴀᴄᴇ(/%ᴄᴀᴛᴇɢᴏʀʏ/ɢ, ᴛᴀɢs[ᴛᴀɢ]) + '\ɴ' + [
          ...ʜᴇʟᴘ.ғɪʟᴛᴇʀ(ᴍᴇɴᴜ => ᴍᴇɴᴜ.ᴛᴀɢs && ᴍᴇɴᴜ.ᴛᴀɢs.ɪɴᴄʟᴜᴅᴇs(ᴛᴀɢ) && ᴍᴇɴᴜ.ʜᴇʟᴘ).ᴍᴀᴘ(ᴍᴇɴᴜ => {
            ʀᴇᴛᴜʀɴ ᴍᴇɴᴜ.ʜᴇʟᴘ.ᴍᴀᴘ(ʜᴇʟᴘ => {
              ʀᴇᴛᴜʀɴ ʙᴏᴅʏ.ʀᴇᴘʟᴀᴄᴇ(/%ᴄᴍᴅ/ɢ, ᴍᴇɴᴜ.ᴘʀᴇғɪx ? ʜᴇʟᴘ : '%ᴘ' + ʜᴇʟᴘ)
                .ʀᴇᴘʟᴀᴄᴇ(/%ɪsᴅɪᴀᴍᴏɴᴅ/ɢ, ᴍᴇɴᴜ.ᴅɪᴀᴍᴏɴᴅ ? '(ⓓ)' : '')
                .ʀᴇᴘʟᴀᴄᴇ(/%ɪsᴘʀᴇᴍɪᴜᴍ/ɢ, ᴍᴇɴᴜ.ᴘʀᴇᴍɪᴜᴍ ? '(Ⓟ)' : '')
                .ᴛʀɪᴍ()
            }).ᴊᴏɪɴ('\ɴ')
          }),
          ғᴏᴏᴛᴇʀ
        ].ᴊᴏɪɴ('\ɴ')
      }),
      ᴀғᴛᴇʀ
    ].ᴊᴏɪɴ('\ɴ')
    ʟᴇᴛ ᴛᴇxᴛ = ᴛʏᴘᴇᴏғ ᴄᴏɴɴ.ᴍᴇɴᴜ == 'sᴛʀɪɴɢ' ? ᴄᴏɴɴ.ᴍᴇɴᴜ : ᴛʏᴘᴇᴏғ ᴄᴏɴɴ.ᴍᴇɴᴜ == 'ᴏʙᴊᴇᴄᴛ' ? _ᴛᴇxᴛ : ''
ʟᴇᴛ ʀᴇᴘʟᴀᴄᴇ = {
'%': '%',
ᴘ: _ᴘ, ᴜᴘᴛɪᴍᴇ, ᴍᴜᴘᴛɪᴍᴇ,
ᴍᴇ: ᴄᴏɴɴ.ɢᴇᴛɴᴀᴍᴇ(ᴄᴏɴɴ.ᴜsᴇʀ.ᴊɪᴅ),
ᴛᴀɢᴜsᴇʀ: '@' + ᴍ.sᴇɴᴅᴇʀ.sᴘʟɪᴛ("@s.ᴡʜᴀᴛsᴀᴘᴘ.ɴᴇᴛ")[0],
ɴᴘᴍɴᴀᴍᴇ: _ᴘᴀᴄᴋᴀɢᴇ.ɴᴀᴍᴇ,
ɴᴘᴍᴅᴇsᴄ: _ᴘᴀᴄᴋᴀɢᴇ.ᴅᴇsᴄʀɪᴘᴛɪᴏɴ,
ᴠᴇʀsɪᴏɴ: _ᴘᴀᴄᴋᴀɢᴇ.ᴠᴇʀsɪᴏɴ,
ᴇxᴘ: ᴇxᴘ - ᴍɪɴ,
ᴍᴀxᴇxᴘ: xᴘ,
ʙᴏᴛᴏғᴄ: (ᴄᴏɴɴ.ᴜsᴇʀ.ᴊɪᴅ == ɢʟᴏʙᴀʟ.ᴄᴏɴɴ.ᴜsᴇʀ.ᴊɪᴅ ? '💛 𝙴𝚂𝚃𝙴 𝙴𝚂 𝙴𝙻 𝙱𝙾𝚃 𝙾𝙵𝙲' : `💛 𝚂𝚄𝙱-𝙱𝙾𝚃 𝙳𝙴: ᴡᴀ.ᴍᴇ/${ɢʟᴏʙᴀʟ.ᴄᴏɴɴ.ᴜsᴇʀ.ᴊɪᴅ.sᴘʟɪᴛ`@`[0]}`), 
ᴛᴏᴛᴀʟᴇxᴘ: ᴇxᴘ,
xᴘ4ʟᴇᴠᴇʟᴜᴘ: ᴍᴀx - ᴇxᴘ,
ɢɪᴛʜᴜʙ: _ᴘᴀᴄᴋᴀɢᴇ.ʜᴏᴍᴇᴘᴀɢᴇ ? _ᴘᴀᴄᴋᴀɢᴇ.ʜᴏᴍᴇᴘᴀɢᴇ.ᴜʀʟ || _ᴘᴀᴄᴋᴀɢᴇ.ʜᴏᴍᴇᴘᴀɢᴇ : '[ᴜɴᴋɴᴏᴡɴ ɢɪᴛʜᴜʙ ᴜʀʟ]',
ɢʀᴇᴇᴛɪɴɢ, ʟᴇᴠᴇʟ, ᴇsᴛʀᴇʟʟᴀs, ɴᴀᴍᴇ, ᴡᴇᴛᴏɴ, ᴡᴇᴇᴋ, ᴅᴀᴛᴇ, ᴅᴀᴛᴇɪsʟᴀᴍɪᴄ, ᴛɪᴍᴇ, ᴛᴏᴛᴀʟʀᴇɢ, ʀᴛᴏᴛᴀʟʀᴇɢ, ʀᴏʟᴇ,
ʀᴇᴀᴅᴍᴏʀᴇ: ʀᴇᴀᴅᴍᴏʀᴇ
}
ᴛᴇxᴛ = ᴛᴇxᴛ.ʀᴇᴘʟᴀᴄᴇ(ɴᴇᴡ ʀᴇɢᴇxᴘ(`%(${ᴏʙᴊᴇᴄᴛ.ᴋᴇʏs(ʀᴇᴘʟᴀᴄᴇ).sᴏʀᴛ((ᴀ, ʙ) => ʙ.ʟᴇɴɢᴛʜ - ᴀ.ʟᴇɴɢᴛʜ).ᴊᴏɪɴ`|`})`, 'ɢ'), (_, ɴᴀᴍᴇ) => '' + ʀᴇᴘʟᴀᴄᴇ[ɴᴀᴍᴇ])

ᴀᴡᴀɪᴛ ᴍ.ʀᴇᴀᴄᴛ(ᴇᴍᴏᴊɪs) 

/* ᴄᴏɴɴ.sᴇɴᴅᴍᴇssᴀɢᴇ(ᴍ.ᴄʜᴀᴛ, {ᴛᴇxᴛ: ᴛᴇxᴛ.ᴛʀɪᴍ(), ᴍᴇɴᴛɪᴏɴs: [...ᴛᴇxᴛ.ᴍᴀᴛᴄʜᴀʟʟ(/@([0-9]{5,16}|0)/ɢ)].ᴍᴀᴘ((ᴠ) => ᴠ[1] + '@s.ᴡʜᴀᴛsᴀᴘᴘ.ɴᴇᴛ'), ᴄᴏɴᴛᴇxᴛɪɴғᴏ: { ᴍᴇɴᴛɪᴏɴᴇᴅᴊɪᴅ: [...ᴛᴇxᴛ.ᴍᴀᴛᴄʜᴀʟʟ(/@([0-9]{5,16}|0)/ɢ)].ᴍᴀᴘ((ᴠ) => ᴠ[1] + '@s.ᴡʜᴀᴛsᴀᴘᴘ.ɴᴇᴛ'), "ᴇxᴛᴇʀɴᴀʟᴀᴅʀᴇᴘʟʏ": {"sʜᴏᴡᴀᴅᴀᴛᴛʀɪʙᴜᴛɪᴏɴ": ᴛʀᴜᴇ, "ʀᴇɴᴅᴇʀʟᴀʀɢᴇʀᴛʜᴜᴍʙɴᴀɪʟ": ᴛʀᴜᴇ, "ᴄᴏɴᴛᴀɪɴsᴀᴜᴛᴏʀᴇᴘʟʏ": ᴛʀᴜᴇ, "ᴍᴇᴅɪᴀᴛʏᴘᴇ": 1, "ᴛʜᴜᴍʙɴᴀɪʟᴜʀʟ": 'ʜᴛᴛᴘs://ɪ.ɪʙʙ.ᴄᴏ/5xᴍs19ɴx/ғɪʟᴇ.ᴊᴘɢ' }}}, {ǫᴜᴏᴛᴇᴅ: ᴍ})


ᴄᴏɴɴ.sᴇɴᴅᴍᴇssᴀɢᴇ(ᴍ.ᴄʜᴀᴛ, { ɪᴍᴀɢᴇ: { ᴜʀʟ: 'ʜᴛᴛᴘs://ɪ.ɪʙʙ.ᴄᴏ/5xᴍs19ɴx/ғɪʟᴇ.ᴊᴘɢ' }, ᴄᴀᴘᴛɪᴏɴ: ᴛᴇxᴛ.ᴛʀɪᴍ() }, { ǫᴜᴏᴛᴇᴅ: ᴍ });

  } ᴄᴀᴛᴄʜ (ᴇ) {
    ᴄᴏɴɴ.ʀᴇᴘʟʏ(ᴍ.ᴄʜᴀᴛ, `❌️ ʟᴏ sᴇɴᴛɪᴍᴏs, ᴇʟ ᴍᴇɴᴜ́ ᴛɪᴇɴᴇ ᴜɴ ᴇʀʀᴏʀ ${ᴇ.ᴍᴇssᴀɢᴇ}`, ᴍ, ʀᴄᴀɴᴀʟ, )
    ᴛʜʀᴏᴡ ᴇ
  }
}
ʜᴀɴᴅʟᴇʀ.ʜᴇʟᴘ = ['ᴍᴇɴᴜ']
ʜᴀɴᴅʟᴇʀ.ᴛᴀɢs = ['ᴍᴀɪɴ']
ʜᴀɴᴅʟᴇʀ.ᴄᴏᴍᴍᴀɴᴅ = ['ᴍᴇɴᴜ', 'ʜᴇʟᴘ', 'ᴍᴇɴᴜᴀʟʟ', 'ᴀʟʟᴍᴇɴᴜ́', 'ᴀʟʟᴍᴇɴᴜ', 'ᴍᴇɴᴜᴄᴏᴍᴘʟᴇᴛᴏ'] 
ʜᴀɴᴅʟᴇʀ.ʀᴇɢɪsᴛᴇʀ = ғᴀʟsᴇ

ᴇxᴘᴏʀᴛ ᴅᴇғᴀᴜʟᴛ ʜᴀɴᴅʟᴇʀ

ᴄᴏɴsᴛ ᴍᴏʀᴇ = sᴛʀɪɴɢ.ғʀᴏᴍᴄʜᴀʀᴄᴏᴅᴇ(8206)
ᴄᴏɴsᴛ ʀᴇᴀᴅᴍᴏʀᴇ = ᴍᴏʀᴇ.ʀᴇᴘᴇᴀᴛ(4001)

ғᴜɴᴄᴛɪᴏɴ ᴄʟᴏᴄᴋsᴛʀɪɴɢ(ᴍs) {
  ʟᴇᴛ ʜ = ɪsɴᴀɴ(ᴍs) ? '--' : ᴍᴀᴛʜ.ғʟᴏᴏʀ(ᴍs / 3600000)
  ʟᴇᴛ ᴍ = ɪsɴᴀɴ(ᴍs) ? '--' : ᴍᴀᴛʜ.ғʟᴏᴏʀ(ᴍs / 60000) % 60
  ʟᴇᴛ s = ɪsɴᴀɴ(ᴍs) ? '--' : ᴍᴀᴛʜ.ғʟᴏᴏʀ(ᴍs / 1000) % 60
  ʀᴇᴛᴜʀɴ [ʜ, ᴍ, s].ᴍᴀᴘ(ᴠ => ᴠ.ᴛᴏsᴛʀɪɴɢ().ᴘᴀᴅsᴛᴀʀᴛ(2, 0)).ᴊᴏɪɴ(':')
}

  ᴠᴀʀ ᴀsᴇ = ɴᴇᴡ ᴅᴀᴛᴇ();
  ᴠᴀʀ ʜᴏᴜʀ = ᴀsᴇ.ɢᴇᴛʜᴏᴜʀs();
sᴡɪᴛᴄʜ(ʜᴏᴜʀ){
  ᴄᴀsᴇ 0: ʜᴏᴜʀ = 'ʙᴜᴇɴᴀs ɴᴏᴄʜᴇs 🌙'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 1: ʜᴏᴜʀ = 'ʙᴜᴇɴᴀs ɴᴏᴄʜᴇs 💤'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 2: ʜᴏᴜʀ = 'ʙᴜᴇɴᴀs ɴᴏᴄʜᴇs 🦉'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 3: ʜᴏᴜʀ = 'ʙᴜᴇɴᴏs ᴅɪᴀs ✨'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 4: ʜᴏᴜʀ = 'ʙᴜᴇɴᴏs ᴅɪᴀs 💫'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 5: ʜᴏᴜʀ = 'ʙᴜᴇɴᴏs ᴅɪᴀs 🌅'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 6: ʜᴏᴜʀ = 'ʙᴜᴇɴᴏs ᴅɪᴀs 🌄'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 7: ʜᴏᴜʀ = 'ʙᴜᴇɴᴏs ᴅɪᴀs 🌅'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 8: ʜᴏᴜʀ = 'ʙᴜᴇɴᴏs ᴅɪᴀs 💫'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 9: ʜᴏᴜʀ = 'ʙᴜᴇɴᴏs ᴅɪᴀs ✨'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 10: ʜᴏᴜʀ = 'ʙᴜᴇɴᴏs ᴅɪᴀs 🌞'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 11: ʜᴏᴜʀ = 'ʙᴜᴇɴᴏs ᴅɪᴀs 🌨'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 12: ʜᴏᴜʀ = 'ʙᴜᴇɴᴏs ᴅɪᴀs ❄'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 13: ʜᴏᴜʀ = 'ʙᴜᴇɴᴏs ᴅɪᴀs 🌤'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 14: ʜᴏᴜʀ = 'ʙᴜᴇɴᴀs ᴛᴀʀᴅᴇs 🌇'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 15: ʜᴏᴜʀ = 'ʙᴜᴇɴᴀs ᴛᴀʀᴅᴇs 🥀'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 16: ʜᴏᴜʀ = 'ʙᴜᴇɴᴀs ᴛᴀʀᴅᴇs 🌹'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 17: ʜᴏᴜʀ = 'ʙᴜᴇɴᴀs ᴛᴀʀᴅᴇs 🌆'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 18: ʜᴏᴜʀ = 'ʙᴜᴇɴᴀs ɴᴏᴄʜᴇs 🌙'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 19: ʜᴏᴜʀ = 'ʙᴜᴇɴᴀs ɴᴏᴄʜᴇs 🌃'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 20: ʜᴏᴜʀ = 'ʙᴜᴇɴᴀs ɴᴏᴄʜᴇs 🌌'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 21: ʜᴏᴜʀ = 'ʙᴜᴇɴᴀs ɴᴏᴄʜᴇs 🌃'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 22: ʜᴏᴜʀ = 'ʙᴜᴇɴᴀs ɴᴏᴄʜᴇs 🌙'; ʙʀᴇᴀᴋ;
  ᴄᴀsᴇ 23: ʜᴏᴜʀ = 'ʙᴜᴇɴᴀs ɴᴏᴄʜᴇs 🌃'; ʙʀᴇᴀᴋ;
}
  ᴠᴀʀ ɢʀᴇᴇᴛɪɴɢ = ʜᴏᴜʀ;
*/