let handler = async (m, { conn }) => {
    let tag = `@${m.sender.split('@')[0]}`;
    let name = await conn.getName(m.sender); // Obtener el nombre del usuario
    let txt = `╔═══════════════╗
┇➤ 𝙃𝙊𝙇𝘼, 𝙃𝙐𝙈𝘼𝙉𝙊
┇ *${tag}* (${name})
╚════════════
*╔════════════════╗*
*║* 𝗠𝗘𝗡𝗨 𝗘𝗟𝗗𝗘𝗥-𝗕𝗢𝗧 👨🏻‍💻  *║*
*╚════════════════╝*

» 𝘉𝘪𝘦𝘯𝘷𝘦𝘯𝘪𝘥𝘰, 𝘦𝘴𝘵𝘦 𝘦𝘴 𝘶𝘯 𝘮𝘦𝘯𝘶́ 𝘳𝘦𝘴𝘶𝘮𝘪𝘥𝘰 𝘥𝘦 𝘵𝘰𝘥𝘰 𝘭𝘰 𝘲𝘶𝘦 𝘤𝘰𝘯𝘵𝘦𝘯𝘦 ...

*\`ɪɴꜰᴏ\`*

☆ 👨🏻‍💻 *ᴘᴇʀꜰɪʟ*
☆ 👨🏻‍💻 *ᴍᴇɴᴜ*
☆ 👨🏻‍💻 *ᴏᴡɴᴇʀ*
☆ 👨🏻‍💻 *ᴛᴏᴛᴀʟғᴜɴᴄɪᴏɴᴇs*
☆ 👨🏻‍💻 *ʀᴜɴᴛɪᴍᴇ*
☆ 👨🏻‍💻 *ʙᴏᴛʀᴇɢʟᴀs*
☆ 👨🏻‍💻 *ᴀғᴋ <ᴛᴇx>*
☆ 👨🏻‍💻 *sᴛᴀғғ*
☆ 👨🏻‍💻 *ʙʟᴏᴄᴋʟɪsᴛ*

*\`ᴀɪ\`*

☆ 🎯 *ʀᴇᴍɪɴɪ*
☆ 🎯 *ʜᴅ*
☆ 🎯 *ᴇɴʜᴀɴᴄᴇ*
☆ 🎯 *ᴡᴀʟʟᴘᴀᴘᴇʀ <ᴛxᴛ>*
☆ 🎯 *ɢᴇᴍɪɴɪ / ɪᴀ*
☆ 🎯 *ᴘɪxᴀɪ*

*\`ʙᴜꜱᴄᴀᴅᴀꜱ\`*

☆ 🕵🏻‍♂️ *ɢᴏᴏɢʟᴇ <ʙᴜ́ꜱǫᴜᴇᴅᴀ>*
☆ 🕵🏻‍♂️ *ᴛɪᴋᴛᴏᴋꜱᴇᴀʀᴄʜ <ᴛxᴛ>*
☆ 🕵🏻‍♂️ *ʏᴛꜱᴇᴀʀᴄʜ*
☆ 🕵🏻‍♂️ *ɪᴍᴀɢᴇɴ <ᴛxᴛ>*
☆ 🕵🏻‍♂️ *ᴘʟᴀʏ* <ᴍᴜꜱɪᴄᴀ>
☆ 🕵🏻‍♂️ *ʏᴛᴅʟᴍᴘ4* <ɴᴏᴍʙʀᴇ>
☆ 🕵🏻‍♂️ *ʏᴛᴅʟᴍᴘ3* <ɴᴏᴍʙʀᴇ>

*\`ᴊᴜᴇɢᴏꜱ\`*

☆ 🕹️ *ɢᴀʏ <@ᴛᴀɢ>*
☆ 🕹️ *ᴍᴀɴᴄᴏ <@ᴛᴀɢ>*
☆ 🕹️ *ᴍᴀɴᴄᴀ <@ᴛᴀɢ>*
☆ 🕹️ *ᴘᴜᴛᴏ <@ᴛᴀɢ>*
☆ 🕹️ *ᴘᴜᴛᴀ <@ᴛᴀɢ>*
☆ 🕹️ *ᴘᴀᴊᴇʀᴏ <@ᴛᴀɢ>*
☆ 🕹️ *ᴘᴀᴊᴇʀᴀ <@ᴛᴀɢ>*
☆ 🕹️ *ʀᴀᴛᴀ <@ᴛᴀɢ>*
☆ 🕹️ *ᴅᴀᴅᴏ <@ᴛᴀɢ>*
☆ 🕹️ *ᴅᴇᴄʟᴀʀᴀᴄɪᴏ́ɴ*
☆ 🕹️ *ғᴏʀᴍᴀʀᴘᴀʀᴇᴊᴀ*
☆ 🕹️ *ʀᴇᴛᴏ*
☆ 🕹️ *sᴏᴘᴀ*
☆ 🕹️ *ʟᴏᴠᴇ*
☆ 🕹️ *ʟᴏᴠᴇ2 <@ᴛᴀɢ>*
☆ 🕹️ *ᴍᴇᴍᴇ*
☆ 🕹️ *ʀᴜʟᴇᴛᴀ*
☆ 🕹️ *ᴀʙʀᴀᴢᴀʀ <@ᴛᴀɢ>*
☆ 🕹️ *ᴀᴄᴇʀᴛɪᴊᴏ*
☆ 🕹️ *ꜱᴏɴʀᴏᴊᴀʀꜱᴇ <@ᴛᴀɢ>*
☆ 🕹️ *ᴄᴏɴꜱᴇᴊᴏ*
☆ 🕹️ *ᴇɴᴀᴍᴏʀᴀᴅᴀ <@ᴛᴀɢ>*
☆ 🕹️ *ᴍᴇᴍᴇ*
☆ 🕹️ *ᴀᴄᴀʀɪᴄɪᴀʀ <@ᴛᴀɢ>*
☆ 🕹️ *ᴘᴇʀꜱᴏɴᴀʟɪᴅᴀᴅ*
☆ 🕹️ *ᴘɪʀᴏᴘᴏ*
☆ 🕹️ *ᴘᴏᴋᴇᴅᴇx <ᴘᴏᴋᴇᴍᴏ́ɴ>*
☆ 🕹️ *ᴘʀᴇɢᴜɴᴛᴀ*
☆ 🕹️ *ᴅᴏʀᴍɪʀ <@ᴛᴀɢ>*
☆ 🕹️ *ᴛʀɪꜱᴛᴇ <@ᴛᴀɢ>*
☆ 🕹️ *ᴛᴏᴘ <ᴛxᴛ>*
☆ 🕹️ *ᴢᴏᴅɪᴀᴄ <2010 03 15*

*\`ʀᴘɢ\`*

☆ 📌 *ʙᴀʟ*
☆ 📌 *ᴄʀɪᴍᴇɴ*
☆ 📌 *ᴅᴀɪʟʏ*
☆ 📌 *ᴄʟᴀɪᴍ*
☆ 📌 *ᴅᴇᴘᴏꜱɪᴛᴀʀ*
☆ 📌 *ʟʙ*
☆📌 *ʀᴇᴛɪʀᴀʀ*
☆ 📌 *ʀᴏʙ2*
☆ 📌 *ʀᴏʙ*
☆ 📌 *ᴛʀᴀʙᴀᴊᴀʀ*
☆ 📌 *ʙᴜʏ*
☆ 📌 *ʙᴜʏ ᴀʟʟ*

*\`ꜱᴛɪᴄᴋᴇʀꜱ\`*

☆ 🎭 *ǫᴄ*
☆ 🎭 *ꜱᴛɪᴋᴇʀ <ɪᴍɢ>*
☆ 🎭 *ꜱᴛɪᴄᴋᴇʀ <ᴜʀʟ>*
☆ 🎭 *ᴛᴀᴋᴇ <ɴᴏᴍʙʀᴇ/ᴀᴜᴛᴏʀ>*

*\`+18\`*

☆ 🔞 *xɴxxꜱᴇᴀʀᴄʜ <ᴛxᴛ>*
☆ 🔞 *xɴxxᴅʟ <ʟɪɴᴋ>*

*\`ɢʀᴜᴘᴏꜱ\`*

☆ 👑 *ʟɪɴᴋ*
☆ 👑 *ɢʀᴜᴘᴏ ᴏᴘᴇɴ / ᴄʟᴏꜱᴇ*
☆ 👑 *ᴅᴇʟᴇᴛᴇ*
☆ 👑 *ᴅᴇᴍᴏᴛᴇ*
☆ 👑 *ᴘʀᴏᴍᴏᴛᴇ*
☆ 👑 *ᴇɴᴄᴜᴇꜱᴛᴀ <ᴛxᴛ / ᴛxᴛ>*
☆ 👑 *ʜɪᴅᴇᴛᴀɢ*
☆ 👑 *ɪɴꜰᴏɢʀᴜᴘᴏ*
☆ 👑 *ᴋɪᴄᴋ*
☆ 👑 *ʟɪꜱᴛᴀᴅᴠ*
☆ 👑 *ᴛᴀɢᴀʟʟ <ᴛxᴛ>*
☆ 👑 *ɪɴᴠᴏᴄᴀʀ <ᴛxᴛ>*
☆ 👑 *ʙᴀɴᴄʜᴀᴛ*
☆ 👑 *ᴜɴʙᴀɴᴄʜᴀᴛ*
☆ 👑 *ʙᴀɴᴜsᴇʀ <@ᴛᴀɢ>*
☆ 👑 *ᴜɴʙᴀɴᴜsᴇʀ <@ᴛᴀɢ>*
☆ 👑 *ʀᴜʟᴇᴛᴀʙᴀɴ*
☆ 👑 *ɪɴᴀᴄᴛɪᴠᴏs*
☆ 👑 *ᴀᴅᴍɪɴs <ᴛxᴛ>*
☆ 👑 *sᴏʀᴛᴇᴏ*

*\`ᴏɴ/ᴏғғ\`*

☆ ⚙️ *ᴇɴᴀʙʟᴇ*
☆ ⚙️ *ᴅɪꜱᴀʙʟᴇ*

*\`ᴅᴇꜱᴄᴀʀɢᴀꜱ\`*

☆ 📂 *ꜰᴀᴄᴇʙᴏᴏᴋ - ꜰʙ*
☆ 📂 *ɪᴍᴀɢᴇɴ <ᴛxᴛ>*
☆ 📂 *ɪɴꜱᴛᴀɢʀᴀᴍ - ɪɢ*
☆ 📂 *ᴛɪᴋᴛᴏᴋ*
☆ 📂 *ʏᴛᴍᴘ4*
☆ 📂 *ʏᴛᴍᴘ3*
☆ 📂 *ᴄʟɪᴍᴀ*
☆ 📂 *ᴅᴇᴍᴏ*
☆ 📂 *ғᴜx*
☆ 📂 *ғᴀᴋᴇ*
☆ 📂 *ɢᴇᴛ*
☆ 📂 *ᴅɪғᴜᴍɪɴᴀʀ*

*\`ʜᴇʀʀᴀᴍɪᴇɴᴛᴀꜱ\`*

☆ ⚙️ *ᴛᴏᴀɴɪᴍᴇ*
☆ ⚙️ *ʀᴇᴍɪɴɪ*
☆ ⚙️ *ʜᴅ*
☆ ⚙️ *ᴇɴʜᴀɴᴄᴇ*
☆ ⚙️ *ꜱꜱᴡᴇʙ*
☆ ⚙️ *ꜱꜱ*
☆ ⚙️ *ᴛʀᴀᴅ*

*\`ᴄᴏɴᴠᴇʀᴛɪᴅᴏʀᴇꜱ\`*

☆ 🎋 *ᴛᴏɢɪꜰᴀᴜᴅ*
☆ 🎋 *ᴛᴏɪᴍɢ*
☆ 🎋 *ᴛᴏᴀᴜᴅɪᴏ*

*\`ʟᴏɢᴏꜱ\`*

☆ ⚡ *ʟᴏɢᴏᴄᴏʀᴀᴢᴏɴ*
☆ ⚡ *ʟᴏɢᴏɴᴀʀᴜᴛᴏ*
☆ ⚡ *ʟᴏɢᴏᴘᴀʀᴇᴊᴀ*
☆ ⚡ *ʟᴏɢᴏɢᴀᴛɪᴛᴏ*
☆ ⚡ *ʟᴏɢᴏɴᴇᴏɴ*
☆ ⚡ *ʟᴏɢᴏsᴏʟɪᴛᴀʀɪᴏ*
☆ ⚡ *ʟᴏɢᴏғᴜʀɪsᴛᴀ*
☆ ⚡ *ʟᴏɢᴏɴᴜʙᴇ*
☆ ⚡ *ʟᴏɢᴏᴀɴɢᴇʟ*
☆ ⚡ *ʟᴏɢᴏᴍᴜʀᴄɪᴇʟᴀɢᴏ*
☆ ⚡ *ʟᴏɢᴏʜᴏʀʀᴏʀ*
☆ ⚡ *ʟᴏɢᴏᴄɪᴇʟᴏ*
☆ ⚡ *ʟᴏɢᴏᴘᴏʀᴛᴀᴅᴀғғ*
☆ ⚡ *ʟᴏɢᴏᴘᴜɢ*
☆ ⚡ *ʟᴏɢᴏɢᴜᴇʀʀᴇʀᴏ*

> *© ⍴᥆ᥕᥱrᥱძ ᑲᥡ һᥒ ᥱᥣძᥱr*`.trim();

   m.react('✅');
let perfil = await conn.profilePictureUrl(m.sender, 'image').catch(_ => 'https://i.ibb.co/5xMs19nx/file.jpg');

/* await conn.sendMessage(m.chat, { text: txt, contextInfo: { externalAdReply: { title: botname, body: dev, thumbnailUrl: banner, mediaType: 1, showAdAttribution: true, renderLargerThumbnail: true }}} , { quoted: m })
};
*/
// let bann = 'https://cdnmega.vercel.app/media/9wB1HLrT@Jcn5yrz18NjokOpmyK-SS9u-OZc4SyK_2rsVxxQ6wXI';

 conn.sendMessage(m.chat, { 
    image: { url: banner }, 
    caption: txt, 
    mentions: [m.sender]
}, { quoted: m });
}


handler.command = ['allmenu', 'menu', 'menuall', 'menucompleto'];

export default handler;